rodo/app/controllers/searches_controller.rb

INSERT INTO "searches" ("imie", "nazwisko", "miejscowosc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["imie", "jan"], ["nazwisko", ""], ["miejscowosc", ""], ["created_at", "2018-05-31 15:26:22.803699"], ["updated_at", "2018-05-31 15:26:22.803699"]]
---
    def create
        @search = Search.create(search_params)

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @search = Search.find(params[:id])