app/controllers/zgodas_controller.rb

  def pokaz
    @zgoda=Zgoda.find(params[:id])
---
SELECT  "zgodas".* FROM "zgodas" WHERE "zgodas"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def nowa
    @zgoda = Zgoda.new({:uwagi=>"Brak"})
    @licznik = Zgoda.count + 1
---
SELECT COUNT(*) FROM "zgodas"

  def utworz
    @udzielone = Zgoda.new(udzielone_parametry)
    if @udzielone.save
      flash[:notice] = "Zgoda została pomyślnie utworzona"
      redirect_to(:action=>'index')
    else
      @licznik = Zgoda.count + 1
---
INSERT INTO "zgodas" ("imie", "nazwisko", "miejscowosc", "pozycja", "uwagi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["imie", "jan"], ["nazwisko", ""], ["miejscowosc", ""], ["pozycja", 1], ["uwagi", "Brak"], ["created_at", "2018-05-31 16:03:55.915479"], ["updated_at", "2018-05-31 16:03:55.915479"]]
SELECT COUNT(*) FROM "zgodas"

  def edycja
    @zgoda=Zgoda.find(params[:id])
    @licznik = Zgoda.count
---
SELECT  "zgodas".* FROM "zgodas" WHERE "zgodas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "zgodas"

  def aktualizuj
    @zgoda=Zgoda.find(params[:id])
  if @zgoda.update_attributes(udzielone_parametry)
---
SELECT  "zgodas".* FROM "zgodas" WHERE "zgodas"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "zgodas" SET "miejscowosc" = ?, "nrdomu" = ?, "updated_at" = ? WHERE "zgodas"."id" = ?  [["miejscowosc", "test2"], ["nrdomu", 2], ["updated_at", "2018-06-02 07:26:24.850843"], ["id", 7]]

  def usun
    @zgoda=Zgoda.find(params[:id])
---
SELECT  "zgodas".* FROM "zgodas" WHERE "zgodas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def kasuj
    zgoda = Zgoda.find(params[:id]).destroy
---
SELECT  "zgodas".* FROM "zgodas" WHERE "zgodas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "zgodas" WHERE "zgodas"."id" = ?  [["id", 5]]